#1) შექმენით 5 ელემენტიანი სია, სადაც ჩაწერთ თქვენს საყვარელი მანქანების სახელს

cars = ["Porsche", "Ferrari", "McLaren"]
print(cars)


#2) შექმენით რიცხვების სია, სადაც ჩაწერთ 0-დან 10-ის ჩათვლით ყველა ლუწ რიცხვს

numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(numbers)


# 3) შექმენით 5 ელემენტიანი სია და დაბეჭდეთ მისი მე-4 ელემენტი

list = [1, "dani", "sigma", 6, 7]
print (list[3])

# 4) იგივე სიის მე-3 ინდექსზე მყოფი ელემენტი შეცვალეთ 
#თქვენი სახელით და დაბეჭდეთ მთლიანი სია.

list[3] = "tekla"
print(list)

# 5) შექმენით 3 ელემენტიანი რიცხვების სია და დაბეჭდეთ 
# პირველი და ბოლო ელემენტის ჯამი ინდექსების გამოყენებით

numbers = [0, 1, 2]
print (numbers[0]+numbers[2])


