# 1) შექმენით 3 ელემენტიანი სახელების სია. მომხმარებელს შემოატანინეთ 0-დან 2-ის ჩათვლით ნებისმიერი რიცხვი, 
# სანამ მომხმარებელი არ შემოიტანს რიცხვს საჭირო დიაპაზონში, ხელახლა ვთხოვოთ რიცხვის შემოტანა.
# (გამოიყენეთ while loop-ი)
# დაბეჭდეთ სახელების სიაში მომხმარებლის მიერ შემოტანილ ინდექსზე მყოფი ელემენტი

names = ["Dato", "Nuki", "Dani"]
num = int(input('Please enter a num: '))
while True:
    if num >2 or num<0:
        num = int(input("please enter a number: "))
    else:
        break
print (names[num])
