#1) თქვენი სიტყვებით ახსენით რა არის string და integer. მოიყვანეთ მაგალითები.

# string (str) არის ტექსტური მონაცემი, ნებისმიერი რამ რაც ბრჭყალებში წერია. 
#მაგ:
name = "shadow"
fruit = "banana"
user = "femalegigachad8"
#ასევე შეიძლება ორმაგი ბრჭყალების ნაცვლად (" ") გამოვიყენოთ ერთმაგიც (' ') მაგრამ როდესაც აპოსტროფის 
#გამოყენება დაგვჭირდება ერთმაგი ბრჭყალი არ გამოგვადგება რადგან სისტემა პირველი რომელი ბრჭყალიც წერია აღიქვამს
#როგორც გამხსნელ ბრჭყალად ხოლო დამხურავად მეორე რაც წერია. ამიტომ error იქნება. 
#მაგ:
#info = 'this book isn't mine' - ამაში error-ს დაწერს.
#ეს ყველაფერი რომ თავიდან ავირიდოთ და ნერვები არ მოვისპოთ ჯობს გამოვიყენოთ ორმაგი ბრჭყალები "".



#integer (int) არის რიცხვითი მონაცემი და მას არ სჭირდება ბრჭყალები. 
#მაგ:
aura = 1000
level = 250
number = 123456



