# 5) შექმენით ცარიელი სია. მომხმარებელს შემოატანინეთ 5 სახელი და ჩაამატეთ ისინი ამ სიაში. გადაურეთ ამ სიას for ციკლით, შემდეგ კი სახელის თითოეულ ასოს(დაგჭირდება 2 for ციკლით, ანუ for ციკლი მეორე for ციკლში). ასევე for ციკლების ზემოთ უნდა გქონდეთ შექმნილი კიდევ ერთი ცარიელი სია, სადაც ჩაამატებთ ასოებიდან მხოლოდ თანხმოვნებს.

# გადაურეთ მიღებულ თანხმოვნების სიას და წაშალეთ დუბლიკატები, მოიძიეთ თუ როგორ შეიძლება სიის დასორტირება, დაასროტრირეთ ის ანბანის მიხედვით და დაბეჭდეთ.

names = [ ]
const = [ ]

for i in range(5):
    name = input ("Enter a name: ")
    names.append(name)

for name in names:
    for letter in name.lower():
        if letter in "bcdfghjklmnpqrstvwxyz":
            const.append(letter)


const = sorted(set(const))
print (const)

