# 1) შექმენით 5 ელემენტიანი სია. for ციკლის მეშვეობით მომხმარებელს შემოატანინეთ კიდევ 5 რიცხვი და თითოეული შემოტანილი რიცხვი .append 
# ფუნქციის მეშვეობით ჩაამატეთ არსებულ სიაში. საბოლოოდ დაბეჭდეთ ეს სია

list = [1, 2, 3, 4, 5]

for i in range(5):
    num = int(input("შეიყნე რიცხვი: "))
    list.append(num)
print(list)

# 2) იგივე სიაში მე-3 და მე-4 ელემენტებს შორის ჩასვით თქვენი სახელი. მე-5 ინდექსზე ჩაამატეთ თქვენი ასაკი. სიის თავში ჩაამატეთ თქვენი სიმაღლე. სიის ბოლოში კი თქვემი საყვარელი რიცხვი. საბოლოოდ დაბეჭდეთ ეს სია

list.append(21)
list.insert(2, "tekla")
list.insert(0, 1.50)
list.insert(5, 14)
print (list)

