# 1)განიხილეთ ეს კოდი (რას გამოიტანს):

# name = "vano"
# age = 0
# # print(name + "best")




#1)განიხილეთ ეს კოდი (რას გამოიტანს):

#მოვახდინოთ დეკლარაცია name და მივანიჭოთ მას მნიშვნელობა "vano"
name = "vano"
#შევქმნათ ცვლადი age და შიგნით შევინახოთ ასაკი (0)
age = 0
#print(name + "best")-ეს კოდი წარმოდგენილია კომენტარის სახით ამიტომ პრინტ ფუნქცია ვერ შესრულდება რადგან 
#კომპიუტერი დააიგნორებს მას
# print(name + "best")



#2)კომენტარის გამოყენებით ახსენით რა არის კომენტარი + რისთვის გამოიყენება ის ასევე ახსენით რა არის დებაგიგნი
#კომენტარი არის კონკრეტული კოდის აღწერა. მას კომპიუტერი ვერ კითხულობს და შესაბამისად, 
#მხოლოდ ადამიანისთვისაა განკუთნილი.
#დებაგინგი არის დაერორებული კოდის გასწორება და თავიდან გაშვება


# 3)რა არის ამ კოდში შეცდომა (რომელ ხაზზე)

# name = "vano"
# surname = motiashvili
# height = 1 86
# print(name + surname - height)

#ამ კოდში შეცდომაა 2 და 3 ხაზები
#motiashvili უნდა იყოს სტრინგებით რომ ცვლადს მნიშვნელობა მიენიჭოს ხოლო 3 ხაზზე space არ უნდა იყოს.